Reports/aggregate15-45.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Thread Group:BMS Launch,15,727,698,1413,1414,1862,125,1862,0.000%,.33642,0.58,0.00
Thread Group:Login,15,5347,4649,8879,10075,11479,1518,11479,0.000%,.28341,190.27,0.00
Thread Group:Project Page,15,336,113,815,1035,1040,54,1040,0.000%,.28261,195.20,0.00
Thread Group:Graphics Screen,15,454,465,685,891,2010,29,2010,0.000%,.35562,249.32,0.00
Thread Group:Logout,15,242,78,270,370,2023,45,2023,0.000%,.38549,0.67,0.00
TOTAL,75,1421,472,4306,8414,10075,29,11479,0.000%,.81277,335.94,0.00