Reports/aggregate45-300.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
BMS Launch,45,411,266,705,1183,2045,123,2045,0.000%,.15231,0.26,0.00
Login,45,2439,2523,3144,3333,3855,852,3855,0.000%,.15130,101.59,0.00
Project Page,45,158,83,401,518,1099,39,1099,0.000%,.15166,104.76,0.00
Graphics Screen,45,252,162,540,921,970,28,970,0.000%,.15147,106.20,0.00
Logout,45,151,118,243,533,643,28,643,0.000%,.15153,0.26,0.00
TOTAL,225,682,212,2522,2823,3333,28,3855,0.000%,.67089,277.33,0.00