Results/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
BMS Launch,50,275,258,423,452,512,129,512,0.000%,.29881,0.52,0.00
Login,50,2310,2501,2917,3065,3412,985,3412,0.000%,.29716,199.54,0.00
Logout,50,115,94,161,172,592,55,592,0.000%,.29886,0.52,0.00
TOTAL,150,900,260,2703,2834,3165,55,3412,0.000%,.83335,187.49,0.00